' ----------------------------------------------------------------------------
' Коллекция HeadersFooters и классы HeaderFooter
' Колонтитулы в Word
' HeadersFooters.vbs
' ----------------------------------------------------------------------------
Option Explicit
 
dim oWord, oDoc, oSel, i, MyText
 
Set oWord = CreateObject("Word.Application")
Set oDoc = oWord.Documents
oDoc.Add()
oWord.Visible = true
Set oSel = oWord.Selection
 
MyText = "Колонтитулы в ворде. "
 
For i=0 to 40
    oSel.TypeText MyText & MyText & MyText & MyText & MyText & MyText & MyText
    oSel.TypeParagraph
Next
 
With oDoc(1).Sections(1)
    .PageSetup.OddAndEvenPagesHeaderFooter = true                                              ' Различные колонтитулы в Word для четных и нечетных
    .PageSetup.DifferentFirstPageHeaderFooter = true                                                ' Уникальный колонтитул в Word для первой страницы

    '-------------------------------------------------------------------------------------------
    ' верхний и нижний колонтитулы в ворде для четных
    '-------------------------------------------------------------------------------------------
    .Headers(3).Range.Text = "Заголовок – четные1, 2,4,6....."
    .Footers(3).Range.Text = "Футер – четные1, 2,4,6....."
    '-------------------------------------------------------------------------------------------

    '-------------------------------------------------------------------------------------------
    ' нижний и верхний колонтитулы в ворде для нечетных
    '-------------------------------------------------------------------------------------------
    .Headers(1).Range.Text = "Заголовок – нечетные1, 1,3,5....."
    .Footers(1).Range.Text = "Футер – нечетные1, 1,3,5....."
    '-------------------------------------------------------------------------------------------

    '-------------------------------------------------------------------------------------------
    ' Верхний и нижний колонтитулы в Word для первой страницы
    '-------------------------------------------------------------------------------------------
    .Headers(2).Range.Text = "Заголовок"
    .Footers(2).Range.Text = "Футер"
    '-------------------------------------------------------------------------------------------
End With